backend/controllers/ComprasController.php

    protected function findModel($id)
    {
        if (($model = Compras::findOne($id)) !== null) {
---
SELECT * FROM `compras` WHERE `id`='1'