backend/controllers/EmpresaController.php

    public function actionCreate()
    {
        $model = new Empresa();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `empresa` (`nombre`, `descripcion`, `direccion`, `telefono`) VALUES ('Burger King', 'Burger King es una cadena estadounidense de restaurantes de comida rápida, especializada en la confección de hamburguesas y sándwiches.', 'C. 39 195, Centro, 97780 Valladolid, Yuc.', '985 856 40')

    protected function findModel($id)
    {
        if (($model = Empresa::findOne($id)) !== null) {
---
SELECT * FROM `empresa` WHERE `id`='1'