backend/controllers/PedidoDetalleController.php

    public function actionCreate()
    {
        $model = new PedidoDetalle();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `pedido_detalle` (`pedido_id`, `empresa_id`, `compra_id`, `precio_compra`, `precio_venta`) VALUES (2, 1, 1, 82, 12)
SELECT EXISTS(SELECT * FROM `pedido_detalle` WHERE `pedido_detalle`.`pedido_id`='2')