backend/controllers/PedidoController.php

SELECT * FROM `pedido` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Pedido::findOne($id)) !== null) {