backend/controllers/ProductosController.php

SELECT * FROM `productos` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Productos::findOne($id)) !== null) {